/*
 * =====================================================================================
 *
 *       Filename:  1.cpp
 *
 *    Description:  1.1
 *
 *        Version:  1.0
 *        Created:  2015年09月28日 15时47分30秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  sun lianqiang (milton), 170262941@qq.com
 *        Company:  Giant
 *
 * =====================================================================================
 */

/*************************************************************************
    > File Name: 1.cpp
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2015年09月28日 星期一 15时47分30秒
 ************************************************************************/

#include<iostream>
using namespace std;

int main()
{
	return -1;
}
